Revit 2027 API
IFCFile.CreateStyle(ExporterIFC, IFCAnyHandle) Method
 Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle CreateStyle(
	ExporterIFC exporterIFC,
	IFCAnyHandle repItem
)
Public Function CreateStyle (
	exporterIFC As ExporterIFC,
	repItem As IFCAnyHandle
) As IFCAnyHandle
public:
IFCAnyHandle^ CreateStyle(
	ExporterIFC^ exporterIFC,
	IFCAnyHandle^ repItem
)
member CreateStyle :
        exporterIFC : ExporterIFC *
        repItem : IFCAnyHandle -> IFCAnyHandle
Parameters
exporterIFC ExporterIFC
 The exporter.
repItem IFCAnyHandle
 The representation item.
Return Value
IFCAnyHandle
 The handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCFile Class
CreateStyle Overload
Autodesk.Revit.DB.IFC Namespace